# LockedEndOffset Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..LockedEndOffset Property
ParameterTypeId Class See Also
---
"Positive Offset"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId LockedEndOffset { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LockedEndOffset As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ LockedEndOffset {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace